In [2]:
# Import the created module

from attendance import *

### Registered Students CSV File

In [3]:
master = csv("Master Student List.csv")

master.head()

  Roll Number                 Student Name
0  17JF1A0409                  Chandrakala
1  17F21A0205                 Nese Dharani
2  18F21A0433         V.Harshavardhanreddy
3  19F25AO417               B.Sree lakshmi
4  184G5A0307  Chinnadasthagirivali Komali

### Gotomeeting Session Attendance Excel File

In [4]:
goToMeetingAttendanceFile = "Day6_27_2020.xls"

In [5]:
day4 = excel(goToMeetingAttendanceFile)
day4.head()

,Name,Email Address,Time in Session (minutes)
0,11307825-korada saran kumar-(LPU) lovely profe...,koradasarankumar@gmail.com,129
1,1210416115-Charan Teja Chetty Muni- GITAM Vizag,charantej.chetty@gmail.com,8
2,1210416115-Charan Teja Chetty Muni- GITAM Vizag,charantej.chetty@gmail.com,106
3,121710304049-vijay sana-gitam,vijaysvijju.11@outlook.com,129
4,133C1A0505-DOKKU SOMA GANESH-3C ( D.M.S.S.V.H ...,somaganesh.d@gmail.com,0

# Extracting the Roll numbers from Name

## Grouping all the rejoined students if any and calculating total time in the session

In [6]:
day4.groupby('Name').sum().reset_index(inplace = True)

### Taking only students who have been in the meeting atleast 45min

In [7]:
req_time = filterdf(day4, 45)
req_time.head()

,Name,Email Address,Time in Session (minutes)
0,11307825-korada saran kumar-(LPU) lovely profe...,koradasarankumar@gmail.com,129
2,1210416115-Charan Teja Chetty Muni- GITAM Vizag,charantej.chetty@gmail.com,106
3,121710304049-vijay sana-gitam,vijaysvijju.11@outlook.com,129
6,133C1A0505-DOKKU SOMA GANESH-3C ( D.M.S.S.V.H ...,somaganesh.d@gmail.com,116
8,15258-M-110_Ganesh Perumallu _Swarnandhra,v.ganeshperumallu@gmail.com,128

In [8]:
req_time.shape

(72, 3)

In [9]:
req_time['Name'][req_time['Name'].duplicated()]

Series([], Name: Name, dtype: object)

### Spliting the Roll numbers based on `-, ' ', _, (`

In [10]:
result = split_name(req_time['Name'], '-')

result = split_name(result, ' ')

result = split_name(result, '_')

result = split_name(result, '(')

FinalRollNUmbers = remove_trainers(result)

In [11]:
len(FinalRollNUmbers)

68

### Converting all roll numbers to `Upper case`

In [12]:
FinalRollNUmbers = rollNumber_upper(FinalRollNUmbers)

In [13]:
import pandas as pd

In [14]:
FinalStudentAttendees = pd.DataFrame(FinalRollNUmbers, columns=['Roll Number'])
FinalStudentAttendees[str(pd.datetime.today().date())] = ['P' for i in range(len(FinalRollNUmbers))]
FinalStudentAttendees.head()

    Roll Number 2020-06-27
0      11307825          P
1    1210416115          P
2  121710304049          P
3    133C1A0505          P
4         15258          P

### Merging the main students df and gotomeeting students df

In [15]:
FinalStudentAttendees = pd.merge(master, FinalStudentAttendees, how = 'left', on = 'Roll Number')

In [16]:
master.shape

(142, 2)

In [17]:
FinalStudentAttendees[str(pd.datetime.today().date())].value_counts()

P    65
Name: 2020-06-27, dtype: int64

In [18]:
Unknown = pd.merge(master, FinalStudentAttendees, how = 'right', on = 'Roll Number').tail(10)
Unknown

,Roll Number,Student Name_x,Student Name_y,2020-06-27
134,18A85A0241,Punnam Pavani Venkata Durga,Punnam Pavani Venkata Durga,P
135,15258-M-110,V.Ganeshperumallu,V.Ganeshperumallu,NaN
136,316114110007,Sravani chappidi,Sravani chappidi,NaN
137,190030431,DWARAMPUDI VIJAYA SREE SAI REDDY,DWARAMPUDI VIJAYA SREE SAI REDDY,P
138,17K61A0255,Teeda.Haritha Hema Rani,Teeda.Haritha Hema Rani,NaN
139,17MIS0068,GOWTHAM KUMAR KOMMANA,GOWTHAM KUMAR KOMMANA,P
140,18A91A04L9,Nagireddy Mahadevi,Nagireddy Mahadevi,P
141,19KD1A0543,Chippaladurgakalyan,Chippaladurgakalyan,P
142,316506402052,MALLELA UJWALA,MALLELA UJWALA,P
143,1872076,Peyyala Rupeswari,Peyyala Rupeswari,P

In [19]:
FinalStudentAttendees.fillna('A', inplace=True)

In [20]:
FinalStudentAttendees.to_excel(str(pd.datetime.today().date())+'.xlsx')